DESAFIO:

1) Importe o arquivo alunos.csv e armazene seu conteúdo  em um DataFrame pandas.
2) Visualize as primeiras 7 linhas do DataFrame e as 5 últimas
3) Confira a quantidade linhas e colunas desse DataFrame
4) Explore as colunas do DataFrame e analise  os tipos dos dados presentes em cada coluna.

In [1]:
import pandas as pd

Visualize as primeiras 7 linhas do DataFrame e as 5 últimas

In [13]:
url = "Dataset/dataset.csv"
dados = pd.read_csv(url,sep=",")
dados.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [5]:
dados.tail(5)

              DataSet:
Mirla  25 9.0     True
Paulo  37 NaN    False
Mylena 29 7.0     True
Lucas  33 NaN    False
Nadia  34 8.0     True

In [4]:
dados.shape

(19, 1)

In [11]:
dados.info

<bound method DataFrame.info of                        DataSet:
Nome      Idade Notas  Aprovado
Ary       20    7.5        True
Ana       18    NaN       False
Cátia     27    2.5       False
Denis     18    5.0       False
Beto      21    10.0       True
Bruna     23    NaN       False
Dara      21    7.0        True
Carlos    19    6.0        True
Alice     35    5.6       False
Vitor     28    NaN       False
Daniel    21    NaN       False
Igor      24    4.5       False
Sthefanie 26    9.5        True
Mirla     25    9.0        True
Paulo     37    NaN       False
Mylena    29    7.0        True
Lucas     33    NaN       False
Nadia     34    8.0        True>

In [14]:
dados.columns

Index(['Nome', 'Idade', 'Notas', 'Aprovado'], dtype='object')